<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 1: SQL

This lab is meant to be run as a `jupyter` notebook, you
could download it [here](lab1.zip) (the zip-file contains
the notebook and the database, and a [.html-file](lab1.html)
which you can read in case you have problems reading/running
jupyter notebooks).

To start your notebook, you can use the following commands
(after you've downloaded [the zip file](lab1.zip)):

```sh
unzip lab1.zip
jupyter notebook
```

This should start jupyter in a browser tab, and there you
can click "lab1.ipynb".


## Background

We have a database to handle the academic achievements of
students at LTH -- in it we have three tables:

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>students:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>social security number</td>
 </tr>
 <tr>
  <td><code>first_name</code></td>
  <td>first name (obviously!)</td>
 </tr>
 <tr>
  <td><code>last_name</code></td>
  <td>last name</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>course code, like <code>EDAF75</code></td>
 </tr>
 <tr>
  <td><code>course_name</code></td>
  <td>the name of the course, like "Database Technology"</td>
 </tr>
 <tr>
  <td><code>level</code></td>
  <td>the course level, like "G1", "G2", or "A"</td>
 </tr>
 <tr>
  <td><code>credits</code></td>
  <td>the number of credits for the course, like 7.5</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>taken_courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>the social security number of a student</td>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>the course code for the course the student has taken</td>
 </tr>
 <tr>
  <td><code>grade</code></td>
  <td>the grade for the student passing the course</td>
 </tr>
</table>

<hr>

<center>
  <img src="lab1.png">
</center>

Some sample data:

```text
ssn           first_name   last_name
---           ----------   ---------
861103–2438   Bo           Ek
911212–1746   Eva          Alm
950829–1848   Anna         Nyström
...           ...          ...

course_code   course_name                   level    credits
-----------   -----------                   -----    -------
EDA016        Programmeringsteknik          G1       7.5
EDAA01        Programmeringsteknik - FK     G1       7.5
EDA230        Optimerande kompilatorer      A        7.5
...           ...                           ...      ...

ssn           course_code   grade
---           -----------   -----
861103–2438   EDA016        4
861103–2438   EDAA01        3
911212–1746   EDA016        3
...           ...           ...
```

The tables have been created with the following SQL
statements:

```sql
CREATE TABLE students (
  ssn          CHAR(11),
  first_name   TEXT NOT NULL,
  last_name    TEXT NOT NULL,
  PRIMARY KEY  (ssn)
);

CREATE TABLE courses (
  course_code   CHAR(6),
  course_name   TEXT NOT NULL,
  level         CHAR(2),
  credits       DOUBLE NOT NULL CHECK (credits > 0),
  PRIMARY KEY   (course_code)
);

CREATE TABLE taken_courses (
  ssn           CHAR(11),
  course_code   CHAR(6),
  grade         INTEGER NOT NULL CHECK (grade >= 3 AND grade <= 5),
  PRIMARY KEY   (ssn, course_code),
  FOREIGN KEY   (ssn) REFERENCES students(ssn),
  FOREIGN KEY   (course_code) REFERENCES courses(course_code)
);
```

All courses offered at the "Computer Science and
Engineering" program at LTH during the academic year 2013/14
are in the table 'courses`. Also, the database has been
filled with made up data. SQL statements like the following
have been used to insert the data:

```sql
INTO   students(ssn, first_name, last_name)
VALUES ('950705-2308', 'Anna', 'Johansson'),
       ('930702-3582', 'Anna', 'Johansson'),
       ('911212-1746', 'Eva', 'Alm'),
       ('910707-3787', 'Eva', 'Nilsson'),
       ...
```

## Assignments

As said above, this lab is designed to be run as a jupyter
notebook. If you haven't got jupyter running, you can run
the sql-commands for the problems below interactively inside
sqlite3, or as a script file with all your commands, or
inside some IDE, like [DB Browser for
SQLite](https://sqlitebrowser.org/).

If you're running the lab as a notebook (and hopefully you
are!), evaluate the following cells before you begin:

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///lab1.sqlite

The tables `students`, `courses` and `taken_courses` are
already in your database, you can see some of their contents
by running the cells below:

In [3]:
%%sql
SELECT  *
FROM    students
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'Anna', 'Johansson'),
 ('930702-3582', 'Anna', 'Johansson'),
 ('911212-1746', 'Eva', 'Alm'),
 ('910707-3787', 'Eva', 'Nilsson')]

In [4]:
%%sql
SELECT  *
FROM    courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('EDA016', 'Programmeringsteknik', 'G1', 7.5),
 ('EDA031', 'C++ - programmering', 'G2', 7.5),
 ('EDA040', 'Realtidsprogrammering', 'G2', 6.0),
 ('EDA050', 'Operativsystem', 'G2', 4.5)]

In [5]:
%%sql
SELECT  *
FROM    taken_courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'EITN35', 5),
 ('950705-2308', 'ESS050', 3),
 ('950705-2308', 'ETIN70', 4),
 ('950705-2308', 'FMA140', 4)]

If you inadvertently change the contents of the tables, you
can always recreate the them with the following command (it
must be run at the command line):

```sh
sqlite3 lab1.sqlite < lab1-setup.sql
```

After some of the questions there is a number in brackets.
This is the number of rows generated by the question. For
instance, [72] after question a) means that there are 72
students in the database, you can use that number as an
indicatation of if your answer is in the right ballpark.

a) What are the names (first name, last name) of all the
   students? [72]

In [7]:
%%sql
SELECT first_name,last_name
FROM students

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Eva', 'Alm'),
 ('Eva', 'Nilsson'),
 ('Elaine', 'Robertson'),
 ('Maria', 'Nordman'),
 ('Helena', 'Troberg'),
 ('Lotta', 'Emanuelsson'),
 ('Anna', 'Nyström'),
 ('Maria', 'Andersson'),
 ('Marie', 'Persson'),
 ('Märit', 'Aspegren'),
 ('Ylva', 'Jacobsson'),
 ('Frida', 'Weidel'),
 ('Caroline', 'Olsson'),
 ('Karolin', 'Ek'),
 ('Eva', 'Hjort'),
 ('Sofia', 'Kjellberg'),
 ('Tina', 'Lööf'),
 ('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Susanne', 'Dahl'),
 ('Birgit', 'Ewesson'),
 ('Ulrika', 'Jonsson'),
 ('Jenny', 'Lundin'),
 ('Karin', 'Östberg'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Gustavsson'),
 ('Niklas', 'Andersson'),
 ('David', 'Carlsson'),
 ('Tobias', 'Enberg'),
 ('Johan', 'Lind'),
 ('Magnus', 'Pettersson'),
 ('Filip', 'Persson'),
 ('Ola', 'Nilsson'),
 ('Jakob', 'Malmberg'),
 ('Henrik', 'Berg'),
 ('John', 'Lind'),
 ('Patrik', 'Lundh'),
 ('Mikael', 'Nilsson'),
 ('Joakim', 'Nilsson'),
 ('Conny', 'Modig'),
 ('Christian', 'Wallman'),
 ('Magnus', 'Strömgren'),
 ('Daniel', 'Ahlman'),
 ('Lars', 'Molin'),
 ('Magnus', 'Nilsson'),
 ('Anders', 'Olsson'),
 ('Martin', 'Alm'),
 ('Håkan', 'Mossgren'),
 ('Fredrik', 'Ryd'),
 ('Mats', 'Wikström'),
 ('Anders', 'Magnusson'),
 ('Andreas', 'Molin'),
 ('Johan', 'Brattberg'),
 ('Johan', 'Olsson'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren'),
 ('Axel', 'Nord'),
 ('Henrik', 'Hult'),
 ('Joakim', 'Hall'),
 ('Henrik', 'Gustavsson'),
 ('Torbjörn', 'Modig'),
 ('Daniel', 'Axelsson'),
 ('Per-Erik', 'Pettersson'),
 ('Roger', 'Brorsson'),
 ('Patrik', 'Ohlsson'),
 ('Peter', 'Solberg')]

b) Same as question a) but produce a sorted listing -- sort
   first by last name and then by first name. (When you get
   it to work, experiment by listing only the 10 first
   students, then try to list only students 11-20, etc.).

In [14]:
%%sql
SELECT first_name,last_name
FROM students
ORDER BY last_name,first_name
LIMIT 10 OFFSET 10

 * sqlite:///lab1.sqlite
Done.

[('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Johan', 'Brattberg'),
 ('Roger', 'Brorsson'),
 ('David', 'Carlsson'),
 ('Susanne', 'Dahl'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Karolin', 'Ek')]

c) What are the names of the students who were born in 1985?
   [4]

In [17]:
%%sql
SELECT first_name,last_name
FROM students
WHERE ssn LIKE '85%'

 * sqlite:///lab1.sqlite
Done.

[('Ulrika', 'Jonsson'), ('Bo', 'Ek'), ('Filip', 'Persson'), ('Henrik', 'Berg')]

d) The next-to-last digit in the social security number is
   even for females, and odd for males. List the first names
   of all female students in our database alphabetically --
   _each name should occur only once_. Hint: the `substr`
   function can be useful. [20]

In [37]:
%%sql
SELECT DISTINCT first_name
FROM students
WHERE substr(ssn,10,1) % 2 = 0
ORDER BY first_name

 * sqlite:///lab1.sqlite
Done.

[('Anna',),
 ('Birgit',),
 ('Caroline',),
 ('Elaine',),
 ('Eva',),
 ('Frida',),
 ('Helena',),
 ('Jenny',),
 ('Karin',),
 ('Karolin',),
 ('Lisa',),
 ('Lotta',),
 ('Maria',),
 ('Marie',),
 ('Märit',),
 ('Sofia',),
 ('Susanne',),
 ('Tina',),
 ('Ulrika',),
 ('Ylva',)]

e) How many students are registered in the database?

In [38]:
%%sql
SELECT count()
FROM students

 * sqlite:///lab1.sqlite
Done.

[(72,)]

_Optional_: Now try to output the number of names in the
   listing in (d) using `count`. It turns out that this is a
   little bit tricky, we need to make sure we use the word
   `DISTINCT` in the right place (look carefully in the
   [documentation](https://sqlite.org/lang_aggfunc.html)).


f) Which courses are offered by the department of
   Mathematics (their course codes have the form `FMAxxx`)?
   [22]

In [40]:
%%sql
SELECT course_code,course_name
FROM courses
WHERE course_code LIKE 'FMA%'

 * sqlite:///lab1.sqlite
Done.

[('FMA021', 'Kontinuerliga system'),
 ('FMA051', 'Optimering'),
 ('FMA091', 'Diskret matematik'),
 ('FMA111', 'Matematiska strukturer'),
 ('FMA120', 'Matristeori'),
 ('FMA125', 'Matristeori, projektdel'),
 ('FMA135', 'Geometri'),
 ('FMA140', 'Olinjära dynamiska system'),
 ('FMA145', 'Olinjära dynamiska system, projektdel'),
 ('FMA170', 'Bildanalys'),
 ('FMA175', 'Bildanalys, projektdel'),
 ('FMA200', 'Variationskalkyl'),
 ('FMA240', 'Linjär och kombinatorisk optimering'),
 ('FMA270', 'Datorseende'),
 ('FMA272', 'Datorseende, projektdel'),
 ('FMA420', 'Linjär algebra'),
 ('FMA430', 'Flerdimensionell analys'),
 ('FMAA01', 'Endimensionell analys'),
 ('FMAF01', 'Matematik - Funktionsteori'),
 ('FMAF05', 'Matematik - System och transformer'),
 ('FMAF10', 'Tillämpad matematik - Linjära system'),
 ('FMAN10', 'Algebraiska strukturer')]

g) Which courses give more than 7.5 credits? [16]

In [45]:
%%sql
SELECT course_code,course_name
FROM courses
WHERE credits > 7.5

 * sqlite:///lab1.sqlite
Done.

[('EDA270', 'Coachning av programvaruteam'),
 ('EDAA05', 'Datorer i system'),
 ('EIEF01', 'Tillämpad mekatronik'),
 ('EIEN01', 'Mekatronik, industriell produktframtagning'),
 ('EIT020', 'Digitalteknik'),
 ('EITF01', 'Digitala bilder – kompression'),
 ('ESS050', 'Elektromagnetisk fältteori'),
 ('ETIA01', 'Elektronik'),
 ('EXTA35', 'Introduktionskurs i kinesiska för civilingenjörer'),
 ('EXTF60', 'Introduktionskurs i kinesiska för civilingenjörer, del 2'),
 ('FAFF25', 'Fysik'),
 ('FMAA01', 'Endimensionell analys'),
 ('FMS012', 'Matematisk statistik, allmän kurs'),
 ('FRTN01', 'Realtidssystem'),
 ('GEMA70', 'Japanska för tekniker'),
 ('MIOA01', 'Industriell ekonomi, allmän kurs')]

h) How may courses are there for each level (`G1`, `G2`, and
   `A`)?

In [47]:
%%sql
SELECT level,count()
FROM courses
GROUP BY level

 * sqlite:///lab1.sqlite
Done.

[('A', 87), ('G1', 31), ('G2', 60)]

In the next few problems, we'll look at the results of the
student with the social security number 910101–1234 -- to
make things _a lot_ easier, you can create a `VIEW` with all
his results.

In [52]:
%%sql
DROP VIEW IF EXISTS taken_by_student;
CREATE VIEW taken_by_student AS
SELECT *
FROM taken_courses
WHERE ssn = '910101-1234'

 * sqlite:///lab1.sqlite
Done.
Done.

[]

i) Which courses (course codes only) have been taken by the
   student with the social security number 910101–1234? [35]

In [55]:
%%sql
SELECT course_code
FROM taken_by_student

 * sqlite:///lab1.sqlite
Done.

[('EDA070',),
 ('EDA385',),
 ('EDAA25',),
 ('EDAF05',),
 ('EEMN10',),
 ('EIT020',),
 ('EIT060',),
 ('EITF40',),
 ('EITN40',),
 ('EITN50',),
 ('ESS050',),
 ('ETIF10',),
 ('ETIF15',),
 ('ETIN35',),
 ('ETS052',),
 ('ETS075',),
 ('ETS200',),
 ('ETSA01',),
 ('EXTA10',),
 ('EXTA35',),
 ('FAFF20',),
 ('FAFF25',),
 ('FMA145',),
 ('FMA420',),
 ('FMAA01',),
 ('FMAF05',),
 ('FMS012',),
 ('FMSF15',),
 ('FMSN30',),
 ('FMSN35',),
 ('FRTN10',),
 ('GEMA45',),
 ('GEMA70',),
 ('MAMF15',),
 ('TEK210',)]

j) What are the names of these courses, and how many credits
   do they give?

In [57]:
%%sql
SELECT course_code,course_name,credits
FROM taken_by_student
JOIN courses
USING (course_code)

 * sqlite:///lab1.sqlite
Done.

[('EDA070', 'Datorer och datoranvändning', 3.0),
 ('EDA385', 'Konstruktion av inbyggda system, fördjupningskurs', 7.5),
 ('EDAA25', 'C-programmering', 3.0),
 ('EDAF05', 'Algoritmer, datastrukturer och komplexitet', 5.0),
 ('EEMN10', 'Datorbaserade mätsystem', 7.5),
 ('EIT020', 'Digitalteknik', 9.0),
 ('EIT060', 'Datasäkerhet', 7.5),
 ('EITF40', 'Digitala och analoga projekt', 7.5),
 ('EITN40', 'Avancerad webbsäkerhet', 4.0),
 ('EITN50', 'Avancerad datasäkerhet', 7.5),
 ('ESS050', 'Elektromagnetisk fältteori', 9.0),
 ('ETIF10', 'Signalbehandling - design och implementering', 7.5),
 ('ETIF15', 'Medicinsk signalbehandling', 7.5),
 ('ETIN35', 'IC-projekt 1', 7.5),
 ('ETS052', 'Datorkommunikation', 4.5),
 ('ETS075', 'Kösystem', 4.5),
 ('ETS200', 'Programvarutestning', 7.5),
 ('ETSA01', 'Ingenjörsprocessen för programvaruutveckling - metodik', 5.0),
 ('EXTA10', 'Introduktion till Kinas samhällsliv, kultur och språk', 3.0),
 ('EXTA35', 'Introduktionskurs i kinesiska för civilingenjörer', 15.0),
 ('FAFF20', 'Multispektral avbildning', 7.5),
 ('FAFF25', 'Fysik', 11.0),
 ('FMA145', 'Olinjära dynamiska system, projektdel', 3.0),
 ('FMA420', 'Linjär algebra', 6.0),
 ('FMAA01', 'Endimensionell analys', 15.0),
 ('FMAF05', 'Matematik - System och transformer', 7.0),
 ('FMS012', 'Matematisk statistik, allmän kurs', 9.0),
 ('FMSF15', 'Markovprocesser', 7.5),
 ('FMSN30', 'Linjär och logistisk regression', 7.5),
 ('FMSN35', 'Stationär och icke-stationär spektralanalys', 7.5),
 ('FRTN10', 'Flervariabel reglering', 7.5),
 ('GEMA45', 'Förståelse och lärande', 3.0),
 ('GEMA70', 'Japanska för tekniker', 15.0),
 ('MAMF15', 'Arbetsorganisation och ledarskap', 6.0),
 ('TEK210', 'Kognition', 4.5)]

k) How many credits has the student taken?

In [58]:
%%sql
SELECT sum(credits)
FROM taken_by_student
JOIN courses
USING (course_code)

 * sqlite:///lab1.sqlite
Done.

[(249.5,)]

l) What is the student’s grade average? We can calculate the
   average either just as the average of all grades
   (unweighted), or use the credits for each course as a
   weight and calculate a weighted average. Try to do the
   calculation both ways (the weighted average can be
   calculated in just one line of code, but we only require
   that you calculate the unweighted average, so don't spend
   too much time on getting the weighted average right).

In [68]:
%%sql
-- SELECT avg(grade)
-- FROM taken_by_student

SELECT sum(grade*credits)/sum(credits)
FROM taken_by_student
JOIN courses
USING (course_code)

 * sqlite:///lab1.sqlite
Done.

[(4.138276553106213,)]

m) Which students have taken 0 credits? [11] This problem
   can be solved in several ways, first do it with an outer
   join:

In [88]:
%%sql
SELECT ssn,first_name,last_name
FROM students
LEFT JOIN taken_courses
USING (ssn)
GROUP BY ssn
HAVING count(course_code) = 0

 * sqlite:///lab1.sqlite
Done.

[('850517-2597', 'Filip', 'Persson'),
 ('870909-3367', 'Caroline', 'Olsson'),
 ('880206-1915', 'Joakim', 'Hall'),
 ('891007-3091', 'Johan', 'Lind'),
 ('891220-1393', 'Erik', 'Andersson'),
 ('900129-3374', 'Henrik', 'Gustavsson'),
 ('900313-2257', 'Erik', 'Andersson'),
 ('911015-3758', 'Jonathan', 'Jönsson'),
 ('931225-3158', 'Bo', 'Ek'),
 ('950125-1153', 'Magnus', 'Hultgren'),
 ('950829-1848', 'Anna', 'Nyström')]

Now do the same thing using a subquery:

In [90]:
%%sql
SELECT ssn,first_name,last_name
FROM students
WHERE ssn NOT IN (
    SELECT ssn 
    FROM taken_courses
)

 * sqlite:///lab1.sqlite
Done.

[('950829-1848', 'Anna', 'Nyström'),
 ('870909-3367', 'Caroline', 'Olsson'),
 ('931225-3158', 'Bo', 'Ek'),
 ('891220-1393', 'Erik', 'Andersson'),
 ('900313-2257', 'Erik', 'Andersson'),
 ('891007-3091', 'Johan', 'Lind'),
 ('850517-2597', 'Filip', 'Persson'),
 ('911015-3758', 'Jonathan', 'Jönsson'),
 ('950125-1153', 'Magnus', 'Hultgren'),
 ('880206-1915', 'Joakim', 'Hall'),
 ('900129-3374', 'Henrik', 'Gustavsson')]

n) List the names and average grades of the 10 students with
   the highest grade average? You can use the unweighted
   average.

In [104]:
%%sql
SELECT (first_name || ' ' || last_name) AS name,ssn,avg(grade)
FROM taken_courses
JOIN students
USING (ssn)
GROUP BY ssn
ORDER BY avg(grade) DESC
LIMIT 10

 * sqlite:///lab1.sqlite
Done.

[('Bo Ek', '861103-2438', 4.35),
 ('Helena Troberg', '910308-1826', 4.3076923076923075),
 ('Elaine Robertson', '931213-2824', 4.235294117647059),
 ('Anna Johansson', '930702-3582', 4.230769230769231),
 ('Ylva Jacobsson', '931208-3605', 4.21875),
 ('Anna Johansson', '950705-2308', 4.2),
 ('Mikael Nilsson', '940801-2971', 4.173913043478261),
 ('Jakob Malmberg', '920812-1857', 4.166666666666667),
 ('Maria Andersson', '860819-2864', 4.157894736842105),
 ('Per-Erik Pettersson', '901030-1895', 4.153846153846154)]

o) List the social security number and total number of
   credits for all students. Students with no credits should
   be included in the listing, with 0 credits (not `NULL`).

   If you do this with an outer join (and I recommend you
   try it!) you might want to use the function
   `coalesce(v1, v2, ...)`; it returns the first value which
   is not `NULL`, so `coalesce(avg(grade), 0)` would give 0
   if the were no grades (i.e., if `grade` were `NULL`), you
   can also try the `ifnull` function.

   (It may be a little bit tricky to get this query right,
   if you're missing the students with 0 credits, don't
   worry, your TA will help you get it right). [72]

In [124]:
%%sql
SELECT ssn,first_name,last_name,sum(coalesce(credits,0)) AS credit_sum
FROM students
LEFT JOIN taken_courses
USING (ssn)
LEFT JOIN courses
USING (course_code)
GROUP BY ssn
ORDER BY credit_sum DESC

 * sqlite:///lab1.sqlite
Done.

[('951004-2346', 'Frida', 'Weidel', 350.0),
 ('880620-2564', 'Susanne', 'Dahl', 348.5),
 ('910915-2068', 'Karolin', 'Ek', 338.0),
 ('920623-3258', 'Magnus', 'Pettersson', 334.0),
 ('921222-2113', 'Mats', 'Wikström', 332.0),
 ('890621-3057', 'Ola', 'Nilsson', 295.5),
 ('920308-3854', 'David', 'Carlsson', 289.0),
 ('930702-3582', 'Anna', 'Johansson', 288.5),
 ('921029-1995', 'Daniel', 'Axelsson', 268.5),
 ('920921-2499', 'Roger', 'Brorsson', 267.5),
 ('891021-1287', 'Lotta', 'Bergman', 267.0),
 ('900227-2369', 'Märit', 'Aspegren', 262.5),
 ('870915-2742', 'Marie', 'Persson', 254.0),
 ('880322-3951', 'Martin', 'Alm', 250.5),
 ('910101-1234', 'Peter', 'Solberg', 249.5),
 ('911020-3538', 'Fredrik', 'Ryd', 241.5),
 ('931208-3605', 'Ylva', 'Jacobsson', 229.5),
 ('940318-2373', 'Conny', 'Modig', 223.0),
 ('900918-3999', 'Henrik', 'Hult', 216.0),
 ('890622-1928', 'Jenny', 'Lundin', 205.0),
 ('901030-1895', 'Per-Erik', 'Pettersson', 192.0),
 ('930502-2040', 'Tina', 'Lööf', 189.0),
 ('911212-1746', 'Eva', 'Alm', 181.0),
 ('920906-3371', 'Andreas', 'Molin', 174.0),
 ('950830-2637', 'Anders', 'Olsson', 174.0),
 ('931128-1333', 'Joakim', 'Nilsson', 171.5),
 ('890820-2496', 'Tobias', 'Enberg', 170.0),
 ('850208-1213', 'Henrik', 'Berg', 166.5),
 ('940801-2971', 'Mikael', 'Nilsson', 161.5),
 ('881110-1272', 'Torbjörn', 'Modig', 154.5),
 ('861103-2438', 'Bo', 'Ek', 153.0),
 ('860206-1065', 'Eva', 'Hjort', 151.0),
 ('930804-3050', 'Patrik', 'Ohlsson', 148.0),
 ('860819-2864', 'Maria', 'Andersson', 140.5),
 ('900206-3735', 'Daniel', 'Ahlman', 139.0),
 ('881030-2772', 'Christian', 'Wallman', 133.0),
 ('940802-3861', 'Birgit', 'Ewesson', 123.0),
 ('940825-1934', 'Filip', 'Gustavsson', 117.5),
 ('931213-2824', 'Elaine', 'Robertson', 111.0),
 ('951122-1048', 'Maria', 'Nordman', 110.0),
 ('910308-1826', 'Helena', 'Troberg', 83.0),
 ('850819-2139', 'Bo', 'Ek', 76.5),
 ('891231-2554', 'Lars', 'Molin', 76.0),
 ('860323-1071', 'Niklas', 'Andersson', 70.5),
 ('900528-1540', 'Sofia', 'Kjellberg', 64.5),
 ('910226-3409', 'Karin', 'Östberg', 63.0),
 ('891106-1277', 'Anders', 'Magnusson', 60.5),
 ('930716-3933', 'Patrik', 'Lundh', 60.0),
 ('890103-1256', 'Johan', 'Brattberg', 52.5),
 ('941003-1225', 'Lotta', 'Emanuelsson', 52.5),
 ('950317-3520', 'Lisa', 'Berg', 43.5),
 ('950705-2308', 'Anna', 'Johansson', 37.5),
 ('920812-1857', 'Jakob', 'Malmberg', 37.0),
 ('950714-2190', 'Håkan', 'Mossgren', 32.5),
 ('900526-1450', 'Magnus', 'Nilsson', 31.0),
 ('850706-2762', 'Ulrika', 'Jonsson', 30.0),
 ('910707-3787', 'Eva', 'Nilsson', 28.5),
 ('931015-1271', 'Magnus', 'Strömgren', 22.5),
 ('920514-3433', 'Johan', 'Olsson', 22.0),
 ('950715-2090', 'Axel', 'Nord', 7.5),
 ('930420-2833', 'John', 'Lind', 4.0),
 ('850517-2597', 'Filip', 'Persson', 0),
 ('870909-3367', 'Caroline', 'Olsson', 0),
 ('880206-1915', 'Joakim', 'Hall', 0),
 ('891007-3091', 'Johan', 'Lind', 0),
 ('891220-1393', 'Erik', 'Andersson', 0),
 ('900129-3374', 'Henrik', 'Gustavsson', 0),
 ('900313-2257', 'Erik', 'Andersson', 0),
 ('911015-3758', 'Jonathan', 'Jönsson', 0),
 ('931225-3158', 'Bo', 'Ek', 0),
 ('950125-1153', 'Magnus', 'Hultgren', 0),
 ('950829-1848', 'Anna', 'Nyström', 0)]

p) Do all students have unique names (first name _and_ last
   name)? If not, show the full name and social security
   number for all students who have a namesake. [7]

   As usual there are several ways of solving this, try to
   solve it using a `WITH`-statement where you create a
   table with all duplicate names, and then use it in a
   `JOIN`:

In [134]:
%%sql
WITH duplicate_names AS (
    SELECT first_name,last_name
    FROM students
    GROUP BY first_name,last_name
    HAVING count() > 1
)
SELECT (first_name || ' ' || last_name) AS name, ssn
FROM students
WHERE (first_name, last_name) in (select first_name,last_name FROM duplicate_names)

 * sqlite:///lab1.sqlite
Done.

[('Anna Johansson', '950705-2308'),
 ('Anna Johansson', '930702-3582'),
 ('Bo Ek', '861103-2438'),
 ('Bo Ek', '931225-3158'),
 ('Bo Ek', '850819-2139'),
 ('Erik Andersson', '891220-1393'),
 ('Erik Andersson', '900313-2257')]

q) _Optional:_ List all students who have a an average grade
   higher than the average of all other students with the
   same first name. Try to use weighted averages for the
   invididual students, and compare to just the average of
   averages for the namesakes (we could have weighted their
   averages according to how many total credits they have,
   but that would be a bit over the top). Here you can use
   either a correlated subquery, or a CTE and a `JOIN`.

In [ ]:
%%sql